app/views/shared/_posts.html.erb

SELECT COUNT(*) FROM "replies" WHERE "replies"."post_id" = ?  [["post_id", 2]]
---
            <%= link_to 'Delete', post, method: :delete, data: { confirm: 'Are you sure?' }, class: "button is-danger" %>
            <div class="subtitle-replies is-5 has-text-grey"><%= post.replies.count %> Replies</div>