app/views/posts/_form.html.erb

SELECT "channels".* FROM "channels" ORDER BY created_at desc
---
      <span class="select">
        <%= f.input_field :channel_id, required: true, collection:@channels.map { |c| [c.channel, c.id] }, prompt: "Select channel" %>