app/views/posts/show.html.erb

SELECT "replies".* FROM "replies" WHERE "replies"."post_id" = ?  [["post_id", 1]]
SELECT COUNT(*) FROM "replies" WHERE "replies"."post_id" = ?  [["post_id", 1]]
---

    <h2 class="subtitle is-5 has-text-grey"><%= @post.replies.count %> Replies</h2>