app/controllers/channels_controller.rb

  def index
    @channels = Channel.all
---
SELECT "channels".* FROM "channels"

  def show
    @posts = Post.where('channel_id = ?', @channel.id).order('created_at desc')
    @channels = Channel.all
---
SELECT "posts".* FROM "posts" WHERE (channel_id = 4) ORDER BY created_at desc
SELECT "channels".* FROM "channels" ORDER BY created_at desc

  def create
    @channel = Channel.new(channel_params)

    respond_to do |format|
      if @channel.save
---
INSERT INTO "channels" ("channel", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?)  [["channel", "Career"], ["created_at", "2021-02-28 13:40:58.975854"], ["updated_at", "2021-02-28 13:40:58.975854"], ["slug", "career"]]

  def update
    respond_to do |format|
      if @channel.update(channel_params)
---
UPDATE "channels" SET "channel" = ?, "slug" = ?, "updated_at" = ? WHERE "channels"."id" = ?  [["channel", "General"], ["slug", "general"], ["updated_at", "2021-03-02 14:36:54.134251"], ["id", 8]]

  def destroy
    @channel.destroy
---
DELETE FROM "channels" WHERE "channels"."id" = ?  [["id", 2]]

    def set_channel
      @channel = Channel.find(params[:id])
---
SELECT "channels".* FROM "channels" WHERE "channels"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]