app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at desc
---
  def index
    @posts = Post.all.order('created_at desc')

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id", "channel_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "efweg"], ["content", "rwebwrb"], ["created_at", "2021-01-21 10:00:57.242124"], ["updated_at", "2021-01-21 10:00:57.242124"], ["user_id", 2], ["channel_id", 1]]
---
  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save

SELECT "channels".* FROM "channels" ORDER BY created_at desc
---
    def find_channels
      @channels = Channel.all.order('created_at desc')