app/controllers/replies_controller.rb

INSERT INTO "replies" ("reply", "created_at", "updated_at", "post_id", "user_id", "slug", "parent_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["reply", "eeee"], ["created_at", "2021-03-01 12:45:21.535971"], ["updated_at", "2021-03-01 12:45:21.535971"], ["post_id", 2], ["user_id", 2], ["slug", "eeee"], ["parent_id", 12]]
---
  def create
    @reply = @post.replies.create(reply_params)
    @reply.user_id = current_user.id

    respond_to do |format|
      if @reply.save

DELETE FROM "replies" WHERE "replies"."id" = ?  [["id", 5]]
---
  def destroy
    @reply = @post.replies.find(params[:id])
    @reply.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "replies".* FROM "replies" WHERE "replies"."post_id" = ? AND "replies"."id" = ? LIMIT ?  [["post_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def edit
    @post = Post.find(params[:post_id])
    @reply = @post.replies.find(params[:id])

SELECT "replies".* FROM "replies" WHERE "replies"."post_id" = ? AND "replies"."id" = ? LIMIT ?  [["post_id", 1], ["id", 2], ["LIMIT", 1]]
UPDATE "replies" SET "reply" = ?, "slug" = ?, "updated_at" = ? WHERE "replies"."id" = ?  [["reply", "Cool &#128512;"], ["slug", "cool-128512"], ["updated_at", "2021-03-02 13:22:32.061930"], ["id", 24]]
---
  def update
    @reply = @post.replies.find(params[:id])
    respond_to do |format|
      if @reply.update(reply_params)

SELECT "replies".* FROM "replies" WHERE "replies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_reply
    @reply = Reply.find(params[:id])